scrambletools/ESP_AVB/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_ESP_NETIF_L2_TAP=y

CONFIG_EXAMPLE_USE_INTERNAL_ETHERNET=y
CONFIG_EXAMPLE_ETH_PHY_IP101=y

CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y

CONFIG_NETUTILS_PTPD_PRIORITY1=246
CONFIG_NETUTILS_PTPD_SERVERPRIO=100
CONFIG_NETUTILS_PTPD_TIMEOUT_MS=10000
CONFIG_NETUTILS_PTPD_SETTIME_THRESHOLD_MS=100

CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

CONFIG_FREERTOS_ISR_STACKSIZE=6144

# Disable task WDT for CPU1 idle task — AVB-OUT runs at max priority on
# core 1 and starves IDLE1 by design during real-time streaming.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Disable Ethernet transmit mutex — AVB sockets use the non-timestamped
# transmit path (microsecond DMA descriptor setup only). The PTP daemon
# still uses timestamped transmit on its own socket, but the brief overlap
# risk is acceptable vs the priority inversion caused by the mutex.
CONFIG_ETH_TRANSMIT_MUTEX=n

CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
